bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA169A.xml
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="JTAG Interface" name="JTAG">
            <register-group caption="JTAG Interface" name="JTAG">
                <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1"
                          mask="0xFF" ocd-rw=""/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                </register>
            </register-group>
        </module>
        <module caption="Liquid Crystal Display" name="LCD">
            <register-group caption="Liquid Crystal Display" name="LCD">
                <register caption="LCD Control Register A" name="LCDCRA" offset="0xE4" size="1" ocd-rw="R">
                    <bitfield caption="LCD Enable" mask="0x80" name="LCDEN"/>
                    <bitfield caption="LCD A or B waveform" mask="0x40" name="LCDAB"/>
                    <bitfield caption="LCD Interrupt Flag" mask="0x10" name="LCDIF"/>
                    <bitfield caption="LCD Interrupt Enable" mask="0x08" name="LCDIE"/>
                    <bitfield caption="LCD Buffer Disable" mask="0x04" name="LCDBD"/>
                    <bitfield caption="LCD Contrast Control Disable" mask="0x02" name="LCDCCD"/>
                    <bitfield caption="LCD Blanking" mask="0x01" name="LCDBL"/>
                </register>
                <register caption="LCD Control and Status Register B" name="LCDCRB" offset="0xE5" size="1">
                    <bitfield caption="LCD CLock Select" mask="0x80" name="LCDCS"/>
                    <bitfield caption="LCD 1/2 Bias Select" mask="0x40" name="LCD2B"/>
                    <bitfield caption="LCD Mux Selects" mask="0x30" name="LCDMUX"/>
                    <bitfield caption="LCD Port Masks" mask="0x07" name="LCDPM" values="LCD_PORT_MASK"/>
                </register>
                <register caption="LCD Frame Rate Register" name="LCDFRR" offset="0xE6" size="1">
                    <bitfield caption="LCD Prescaler Selects" mask="0x70" name="LCDPS" values="LCD_PRESCALE"/>
                    <bitfield caption="LCD Clock Dividers" mask="0x07" name="LCDCD" values="MISC_3BIT_COUNT"/>
                </register>
                <register caption="LCD Contrast Control Register" name="LCDCCR" offset="0xE7" size="1">
                    <bitfield caption="LCD Display Configuration Bits" mask="0xE0" name="LCDDC"
                              values="LCD_DISP_CONF_DRIVE"/>
                    <bitfield caption="LCD Maximum Drive Time" mask="0x10" name="LCDMDT"/>
                    <bitfield caption="LCD Contrast Controls" mask="0x0F" name="LCDCC" values="LCD_CONTRAST"/>
                </register>
                <register caption="LCD Data Register 18" name="LCDDR18" offset="0xFE" size="1" mask="0x01"/>
                <register caption="LCD Data Register 17" name="LCDDR17" offset="0xFD" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 16" name="LCDDR16" offset="0xFC" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 15" name="LCDDR15" offset="0xFB" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 13" name="LCDDR13" offset="0xF9" size="1" mask="0x01"/>
                <register caption="LCD Data Register 12" name="LCDDR12" offset="0xF8" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 11" name="LCDDR11" offset="0xF7" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 10" name="LCDDR10" offset="0xF6" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 8" name="LCDDR8" offset="0xF4" size="1" mask="0x01"/>
                <register caption="LCD Data Register 7" name="LCDDR7" offset="0xF3" size="1" mask="0xFF"/>
