bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA169A.xml
                <register caption="LCD Data Register 6" name="LCDDR6" offset="0xF2" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 5" name="LCDDR5" offset="0xF1" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 3" name="LCDDR3" offset="0xEF" size="1" mask="0x01"/>
                <register caption="LCD Data Register 2" name="LCDDR2" offset="0xEE" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 1" name="LCDDR1" offset="0xED" size="1" mask="0xFF"/>
                <register caption="LCD Data Register 0" name="LCDDR0" offset="0xEC" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="LCD_PORT_MASK">
                <value caption="SEG0:12" name="VAL_0x00" value="0x00"/>
                <value caption="SEG0:14" name="VAL_0x01" value="0x01"/>
                <value caption="SEG0:15" name="VAL_0x02" value="0x02"/>
                <value caption="SEG0:18" name="VAL_0x03" value="0x03"/>
                <value caption="SEG0:20" name="VAL_0x04" value="0x04"/>
                <value caption="SEG0:22" name="VAL_0x05" value="0x05"/>
                <value caption="SEG0:23" name="VAL_0x06" value="0x06"/>
                <value caption="SEG0:24" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="LCD_PRESCALE">
                <value caption="ClkLCD/16" name="VAL_0x00" value="0x00"/>
                <value caption="ClkLCD/64" name="VAL_0x01" value="0x01"/>
                <value caption="ClkLCD/128" name="VAL_0x02" value="0x02"/>
                <value caption="ClkLCD/256" name="VAL_0x03" value="0x03"/>
                <value caption="ClkLCD/512" name="VAL_0x04" value="0x04"/>
                <value caption="ClkLCD/1024" name="VAL_0x05" value="0x05"/>
                <value caption="ClkLCD/2048" name="VAL_0x06" value="0x06"/>
                <value caption="ClkLCD/4096" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="MISC_3BIT_COUNT">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="3" name="VAL_0x02" value="0x02"/>
                <value caption="4" name="VAL_0x03" value="0x03"/>
                <value caption="5" name="VAL_0x04" value="0x04"/>
                <value caption="6" name="VAL_0x05" value="0x05"/>
                <value caption="7" name="VAL_0x06" value="0x06"/>
                <value caption="8" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="LCD_DISP_CONF_DRIVE">
                <value caption="300us" name="VAL_0x00" value="0x00"/>
                <value caption="70us" name="VAL_0x01" value="0x01"/>
                <value caption="150us" name="VAL_0x02" value="0x02"/>
                <value caption="450us" name="VAL_0x03" value="0x03"/>
                <value caption="575us" name="VAL_0x04" value="0x04"/>
                <value caption="850us" name="VAL_0x05" value="0x05"/>
                <value caption="1150us" name="VAL_0x06" value="0x06"/>
                <value caption="50% of LCD clock" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="LCD_CONTRAST">
                <value caption="2.60V" name="VAL_0x00" value="0x00"/>
                <value caption="2.65V" name="VAL_0x01" value="0x01"/>
                <value caption="2.70V" name="VAL_0x02" value="0x02"/>
                <value caption="2.75V" name="VAL_0x03" value="0x03"/>
                <value caption="2.80V" name="VAL_0x04" value="0x04"/>
                <value caption="2.85V" name="VAL_0x05" value="0x05"/>
                <value caption="2.90V" name="VAL_0x06" value="0x06"/>
                <value caption="2.95V" name="VAL_0x07" value="0x07"/>
                <value caption="3.00V" name="VAL_0x08" value="0x08"/>
                <value caption="3.05V" name="VAL_0x09" value="0x09"/>
                <value caption="3.10V" name="VAL_0x0A" value="0x0A"/>
                <value caption="3.15V" name="VAL_0x0B" value="0x0B"/>
                <value caption="3.20V" name="VAL_0x0C" value="0x0C"/>
                <value caption="3.25V" name="VAL_0x0D" value="0x0D"/>
                <value caption="3.30V" name="VAL_0x0E" value="0x0E"/>
                <value caption="3.35V" name="VAL_0x0F" value="0x0F"/>
            </value-group>
        </module>
        <module caption="Universal Serial Interface" name="USI">
            <register-group caption="Universal Serial Interface" name="USI">
                <register caption="USI Data Register" name="USIDR" offset="0xBA" size="1" mask="0xFF"/>
                <register caption="USI Status Register" name="USISR" offset="0xB9" size="1" ocd-rw="R">
                    <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
                    <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
                    <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
                    <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
                    <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
                </register>
                <register caption="USI Control Register" name="USICR" offset="0xB8" size="1">
                    <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
                    <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
                    <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
                    <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
                    <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
                    <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_USI_OP">
                <value caption="Normal Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Three-Wire Mode" name="VAL_0x01" value="0x01"/>
                <value caption="Two-Wire Mode" name="VAL_0x02" value="0x02"/>
                <value caption="Two-Wire Mode Held Low" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF3"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS"
                              values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
                    <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
                    <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
                    <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
                    <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
                    <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
                    <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
                    <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF3">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 1.1V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03"
                       value="0x03"/>
            </value-group>
